NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/bootloader_mesh.c
/***********************************************************************************
Copyright (c) Nordic Semiconductor ASA
All rights reserved.

Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

  1. Redistributions of source code must retain the above copyright notice, this
  list of conditions and the following disclaimer.

  2. Redistributions in binary form must reproduce the above copyright notice, this
  list of conditions and the following disclaimer in the documentation and/or
  other materials provided with the distribution.

  3. Neither the name of Nordic Semiconductor ASA nor the names of other
  contributors to this software may be used to endorse or promote products
  derived from this software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
************************************************************************************/
#include <string.h>
#include "bootloader_mesh.h"
#include "sha256.h"
#include "dfu_mesh.h"
#include "dfu_types_mesh.h"
#include "mesh_packet.h"
#include "uECC.h"
#include "transport.h"
#include "bootloader_util.h"
#include "bootloader_rtc.h"
#include "bootloader_info.h"
#include "app_error.h"
#include "journal.h"
#include "serial_handler.h"
#include "serial_evt.h"
#include "nrf_mbr.h"

#define TX_REPEATS_DEFAULT          (3)
#define TX_REPEATS_FWID             (TX_REPEATS_INF)
#define TX_REPEATS_DFU_REQ          (TX_REPEATS_INF)
#define TX_REPEATS_READY            (TX_REPEATS_INF)
#define TX_REPEATS_DATA             (TX_REPEATS_DEFAULT)
#define TX_REPEATS_RSP              (TX_REPEATS_DEFAULT)
#define TX_REPEATS_REQ              (TX_REPEATS_DEFAULT)
#define TX_REPEATS_START            (TX_REPEATS_DEFAULT);

#define TX_INTERVAL_TYPE_FWID       (TX_INTERVAL_TYPE_REGULAR)
#define TX_INTERVAL_TYPE_DFU_REQ    (TX_INTERVAL_TYPE_REGULAR)
#define TX_INTERVAL_TYPE_READY      (TX_INTERVAL_TYPE_REGULAR)
#define TX_INTERVAL_TYPE_DATA       (TX_INTERVAL_TYPE_EXPONENTIAL)
#define TX_INTERVAL_TYPE_RSP        (TX_INTERVAL_TYPE_EXPONENTIAL)
#define TX_INTERVAL_TYPE_REQ        (TX_INTERVAL_TYPE_REGULAR)

#define STATE_TIMEOUT_FIND_FWID     (US_TO_RTC_TICKS(2000000)) /* 2.0s */
#define STATE_TIMEOUT_REQ           (US_TO_RTC_TICKS(1000000)) /* 1.0s */
#define STATE_TIMEOUT_READY         (US_TO_RTC_TICKS(3000000)) /* 3.0s */
#define STATE_TIMEOUT_TARGET        (US_TO_RTC_TICKS(5000000)) /* 5.0s */
#define STATE_TIMEOUT_RAMPDOWN      (US_TO_RTC_TICKS(1000000)) /* 1.0s */

#define IRQ_ENABLED            0x01     /**< Field that identifies if an interrupt is enabled. */
#define MAX_NUMBER_INTERRUPTS  32       /**< Maximum number of interrupts available. */

#define START_ADDRESS_UNKNOWN       (0xFFFFFFFF)

/* important that req-cache isn't too big - might lead to starvation in req-device */
#define REQ_CACHE_SIZE              (4)
#define TRANSACTION_ID_CACHE_SIZE   (8)

#define SENT_PACKET_COUNT           (32)

typedef enum
{
    BEACON_TYPE_FWID,
    BEACON_TYPE_READY_APP,
    BEACON_TYPE_READY_SD,
    BEACON_TYPE_READY_BL
} beacon_type_t;

typedef struct
{
    uint32_t        transaction_id;
    uint8_t         authority;
    dfu_type_t      type;
    uint32_t*       p_start_addr;
    uint32_t*       p_bank_addr;
    uint32_t*       p_indicated_start_addr;
    uint32_t*       p_last_requested_entry;
    uint32_t        length;
    uint32_t        signature_length;
    uint8_t         signature[DFU_SIGNATURE_LEN];
    uint8_t         signature_bitmap;
    uint16_t        segments_remaining;
    uint16_t        segment_count;
    fwid_union_t    target_fwid_union;
    bool            segment_is_valid_after_transfer;
    bool            flood;
} transaction_t;

typedef struct
{
    bl_info_version_t*  p_fwid;
    bl_info_segment_t*  p_segment_sd;
    bl_info_segment_t*  p_segment_bl;
    bl_info_segment_t*  p_segment_app;
    bl_info_flags_t*    p_flags;
    uint8_t*            p_ecdsa_public_key;
    uint8_t*            p_journal;
    uint8_t*            p_signature_sd;
    uint8_t*            p_signature_bl;
    uint8_t*            p_signature_app;
    uint8_t*            p_signature_bl_info;
} bl_info_pointers_t;

static transaction_t        m_transaction;
static bl_state_t           m_state = BL_STATE_FIND_FWID;
static bl_info_pointers_t   m_bl_info_pointers;
static uint16_t             m_req_cache[REQ_CACHE_SIZE];
static uint8_t              m_req_index;
static uint32_t             m_tid_cache[TRANSACTION_ID_CACHE_SIZE];
static uint8_t              m_tid_index;
static volatile uint32_t    m_key_len = uECC_BYTES * 2;
static mesh_packet_t*       mp_sent_packets[SENT_PACKET_COUNT];
static uint32_t             m_sent_packet_index;

static mesh_packet_t*       mp_beacon;

static void packet_release_callback(mesh_packet_t* p_packet)
{
    for (uint32_t i = 0; i < SENT_PACKET_COUNT; ++i)
    {
        if (p_packet == mp_sent_packets[i])
        {
            mp_sent_packets[i] = NULL;
            break;
        }
    }
}

static void interrupts_disable(void)
{
    uint32_t interrupt_setting_mask;
    uint32_t irq;

    /* Fetch the current interrupt settings. */
    interrupt_setting_mask = NVIC->ISER[0];

    /* Loop from interrupt 0 for disabling of all interrupts. */
    for (irq = 0; irq < MAX_NUMBER_INTERRUPTS; irq++)
    {
        if (interrupt_setting_mask & (IRQ_ENABLED << irq))
        {
            /* The interrupt was enabled, hence disable it. */
            NVIC_DisableIRQ((IRQn_Type)irq);
        }
    }
}

