NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/bootloader_mesh.c
static bool app_is_valid(uint32_t* app_start, uint32_t app_length)
{
    return (m_bl_info_pointers.p_segment_app != NULL &&
            *((uint32_t*) m_bl_info_pointers.p_segment_app->start) != 0xFFFFFFFF &&
            m_bl_info_pointers.p_fwid->app.app_version != APP_VERSION_INVALID &&
            !journal_is_invalid(app_start, app_length));
}

static void serial_tx(dfu_packet_t* p_packet, uint16_t len)
{
#ifdef SERIAL
    serial_evt_t evt;
    if (len > RBC_MESH_VALUE_MAX_LEN)
    {
        APP_ERROR_CHECK(NRF_ERROR_INVALID_LENGTH);
    }
    evt.opcode = SERIAL_EVT_OPCODE_DFU;
    evt.length = SERIAL_PACKET_OVERHEAD + len;
    memcpy(&evt.params.dfu.packet, p_packet, len);
    serial_handler_event_send(&evt);
#endif
}


static void set_timeout(uint32_t time)
{
#ifndef NO_TIMEOUTS    
    NRF_RTC0->EVENTS_COMPARE[RTC_BL_STATE_CH] = 0;
    NRF_RTC0->CC[RTC_BL_STATE_CH] = (NRF_RTC0->COUNTER + time) & RTC_MASK;
    NRF_RTC0->INTENSET = (1 << (RTC_BL_STATE_CH + RTC_INTENSET_COMPARE0_Pos));
#endif    
}

static bool signature_check(void)
{
    /* if we don't have a public key we will accept all firmware upgrades. */
    if (m_bl_info_pointers.p_ecdsa_public_key == NULL)
    {
        return true;
    }

    /* if we have a key, but the transfer isn't signed, we will fail */
    if (m_transaction.signature_length == 0)
    {
        return false;
    }
    
    uint8_t hash[uECC_BYTES];
    sha256_context_t hash_context;
    sha256_init(&hash_context);
    sha256_update(&hash_context, (uint8_t*) &m_transaction.type, 1);
    sha256_update(&hash_context, (uint8_t*) &m_transaction.p_indicated_start_addr, 4);
    sha256_update(&hash_context, (uint8_t*) &m_transaction.length, 4);
    switch (m_transaction.type)
    {
        case DFU_TYPE_APP:
            sha256_update(&hash_context, (uint8_t*) &m_transaction.target_fwid_union, DFU_FWID_LEN_APP);
            break;
        case DFU_TYPE_SD:
            sha256_update(&hash_context, (uint8_t*) &m_transaction.target_fwid_union, DFU_FWID_LEN_SD);
            break;
        case DFU_TYPE_BOOTLOADER:
            sha256_update(&hash_context, (uint8_t*) &m_transaction.target_fwid_union, DFU_FWID_LEN_BL);
            break;
        default:
            break;
    }

    dfu_sha256(&hash_context);

    sha256_final(&hash_context, hash);
    return (bool) (uECC_verify(m_bl_info_pointers.p_ecdsa_public_key, hash, m_transaction.signature));
}

static bool ready_packet_is_upgrade(dfu_packet_t* p_packet)
{
    /* check that we haven't failed to connect to this TID before */
    for (uint32_t i = 0; i < TRANSACTION_ID_CACHE_SIZE; ++i)
    {
        if (m_tid_cache[i] == p_packet->payload.state.transaction_id)
        {
            return false;
        }
    }
    
    switch (p_packet->payload.state.dfu_type)
    {
        case DFU_TYPE_APP:
            return (p_packet->payload.state.fwid.app.app_id == m_bl_info_pointers.p_fwid->app.app_id &&
                    p_packet->payload.state.fwid.app.company_id== m_bl_info_pointers.p_fwid->app.company_id &&
                    p_packet->payload.state.fwid.app.app_version > m_bl_info_pointers.p_fwid->app.app_version);

        case DFU_TYPE_BOOTLOADER:
            return (p_packet->payload.state.fwid.bootloader.id ==
                    m_bl_info_pointers.p_fwid->bootloader.id &&
                    p_packet->payload.state.fwid.bootloader.ver > 
                    m_bl_info_pointers.p_fwid->bootloader.ver);

        case DFU_TYPE_SD:
            return (p_packet->payload.state.fwid.sd ==
                    m_bl_info_pointers.p_fwid->sd);
        default:
            return false;
    }
}

static bool ready_packet_matches_our_req(dfu_packet_t* p_packet)
{
    if (p_packet->payload.state.dfu_type != m_transaction.type && m_transaction.type != DFU_TYPE_NONE)
    {
        return false;
    }

    /* check that we haven't failed to connect to this TID before */
    for (uint32_t i = 0; i < TRANSACTION_ID_CACHE_SIZE; ++i)
    {
        if (m_tid_cache[i] == p_packet->payload.state.transaction_id)
        {
            return false;
        }
    }
    switch (m_transaction.type)
    {
        case DFU_TYPE_APP:
            return (memcmp(&p_packet->payload.state.fwid.app,
                &m_transaction.target_fwid_union.app, sizeof(app_id_t)) == 0);

        case DFU_TYPE_BOOTLOADER:
            return (memcmp(&p_packet->payload.state.fwid.bootloader,
                    &m_transaction.target_fwid_union.bootloader, sizeof(bl_id_t)) == 0);

        case DFU_TYPE_SD:
            return (p_packet->payload.state.fwid.sd ==
                    m_transaction.target_fwid_union.sd);
        default:
            return false;
    }
}

static dfu_packet_t* beacon_set(beacon_type_t type)
{
    if (mp_beacon)
    {
        transport_tx_abort(mp_beacon);
        if (!mesh_packet_ref_count_dec(mp_beacon))
        {
            NRF_GPIO->OUTCLR = (1 << 24);
        }
    }
    if (!mesh_packet_acquire(&mp_beacon))
    {
        bootloader_abort(BL_END_ERROR_NO_MEM);
    }
    dfu_packet_t* p_dfu = (dfu_packet_t*) &(((ble_ad_t*) mp_beacon->payload)->data[2]);
    memset(p_dfu, 0, sizeof(dfu_packet_t));

    switch (type)
    {
        case BEACON_TYPE_FWID:
            bootloader_packet_set_local_fields(mp_beacon, DFU_PACKET_LEN_FWID);
            p_dfu->packet_type = DFU_PACKET_TYPE_FWID;
            p_dfu->payload.fwid.app.app_id      = m_bl_info_pointers.p_fwid->app.app_id;
            p_dfu->payload.fwid.app.app_version = m_bl_info_pointers.p_fwid->app.app_version;
            p_dfu->payload.fwid.app.company_id  = m_bl_info_pointers.p_fwid->app.company_id;
            p_dfu->payload.fwid.bootloader      = m_bl_info_pointers.p_fwid->bootloader;
            p_dfu->payload.fwid.sd              = m_bl_info_pointers.p_fwid->sd;
            transport_tx(mp_beacon, TX_REPEATS_FWID, TX_INTERVAL_TYPE_FWID, NULL);
            break;

        case BEACON_TYPE_READY_APP:
            bootloader_packet_set_local_fields(mp_beacon, DFU_PACKET_LEN_STATE_APP);
            p_dfu->packet_type = DFU_PACKET_TYPE_STATE;
            p_dfu->payload.state.dfu_type = DFU_TYPE_APP;
            p_dfu->payload.state.authority = m_transaction.authority;
            p_dfu->payload.state.flood = m_transaction.flood;
            p_dfu->payload.state.transaction_id = m_transaction.transaction_id;
            memcpy(&p_dfu->payload.state.fwid.app, &m_transaction.target_fwid_union.app, sizeof(app_id_t));
            transport_tx(mp_beacon, TX_REPEATS_READY, TX_INTERVAL_TYPE_READY, NULL);
            break;

