NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/bootloader_mesh.c
        case BEACON_TYPE_READY_SD:
            bootloader_packet_set_local_fields(mp_beacon, DFU_PACKET_LEN_STATE_SD);
            p_dfu->packet_type = DFU_PACKET_TYPE_STATE;
            p_dfu->payload.state.dfu_type = DFU_TYPE_SD;
            p_dfu->payload.state.authority = m_transaction.authority;
            p_dfu->payload.state.transaction_id = m_transaction.transaction_id;
            p_dfu->payload.state.fwid.app = m_transaction.target_fwid_union.app;
            transport_tx(mp_beacon, TX_REPEATS_READY, TX_INTERVAL_TYPE_READY, NULL);
            break;

        case BEACON_TYPE_READY_BL:
            bootloader_packet_set_local_fields(mp_beacon, DFU_PACKET_LEN_STATE_BL);
            p_dfu->packet_type = DFU_PACKET_TYPE_STATE;
            p_dfu->payload.state.dfu_type = DFU_TYPE_BOOTLOADER;
            p_dfu->payload.state.authority = m_transaction.authority;
            p_dfu->payload.state.transaction_id = m_transaction.transaction_id;
            p_dfu->payload.state.fwid.bootloader = m_transaction.target_fwid_union.bootloader;
            transport_tx(mp_beacon, TX_REPEATS_READY, TX_INTERVAL_TYPE_READY, NULL);
            break;
    }

    return p_dfu;
}

static inline uint32_t* addr_from_seg(uint16_t segment)
{
    if (segment == 1)
    {
        return m_transaction.p_start_addr;
    }
    else
    {
        return (uint32_t*) (((segment - 1) << 4) + ((uint32_t) m_transaction.p_start_addr & 0xFFFFFFF0));
    }
}

static bool app_is_newer(app_id_t* p_app_id)
{
    return (p_app_id->app_id     == m_bl_info_pointers.p_fwid->app.app_id &&
            p_app_id->company_id == m_bl_info_pointers.p_fwid->app.company_id &&
            p_app_id->app_version > m_bl_info_pointers.p_fwid->app.app_version);
}

static bool bootloader_is_newer(bl_id_t bl_id)
{
    return (bl_id.id == m_bl_info_pointers.p_fwid->bootloader.id &&
            bl_id.ver > m_bl_info_pointers.p_fwid->bootloader.ver);
}

static void update_state_beacon(void)
{
    dfu_packet_t* p_beacon = NULL;
    uint16_t beacon_len = 0;
    switch (m_transaction.type)
    {
        case DFU_TYPE_APP:
            p_beacon = beacon_set(BEACON_TYPE_READY_APP);
            beacon_len = DFU_PACKET_LEN_STATE_APP;
            break;

        case DFU_TYPE_SD:
            p_beacon = beacon_set(BEACON_TYPE_READY_SD);
            beacon_len = DFU_PACKET_LEN_STATE_SD;
            break;

        case DFU_TYPE_BOOTLOADER:
            p_beacon = beacon_set(BEACON_TYPE_READY_BL);
            beacon_len = DFU_PACKET_LEN_STATE_BL;
            break;
        default:
            APP_ERROR_CHECK(NRF_ERROR_NOT_SUPPORTED);
    }

    if (p_beacon)
    {
        serial_tx(p_beacon, beacon_len);
    }
}

/********** STATE MACHINE ENTRY POINTS ***********/
static void start_find_fwid(void)
{
    dfu_packet_t* p_fwid = beacon_set(BEACON_TYPE_FWID);
    set_timeout(STATE_TIMEOUT_FIND_FWID);
    m_state = BL_STATE_FIND_FWID;
    memset(&m_transaction, 0, sizeof(transaction_t));

    serial_tx(p_fwid, DFU_PACKET_LEN_FWID);
}

static void start_req(dfu_type_t type, bool timeout)
{
    m_transaction.authority = 0;
    m_transaction.length = 0;
    m_transaction.p_bank_addr = NULL;
    m_transaction.p_start_addr = NULL;
    m_transaction.segments_remaining = 0xFFFF;
    m_transaction.segment_count = 0;
    m_transaction.segment_is_valid_after_transfer = false;
    m_transaction.signature_length = 0;
    m_transaction.transaction_id = 0;
    m_transaction.type = type;
    if (timeout)
    {
        set_timeout(STATE_TIMEOUT_REQ);
    }
    m_state = BL_STATE_DFU_REQ;

    update_state_beacon();
}

static void start_ready(dfu_packet_t* p_ready_packet)
{
    if (p_ready_packet->packet_type != DFU_PACKET_TYPE_STATE ||
        p_ready_packet->payload.state.authority == 0 ||
        p_ready_packet->payload.state.dfu_type != m_transaction.type)
    {
        APP_ERROR_CHECK(NRF_ERROR_INVALID_PARAM);
    }
    m_transaction.transaction_id = p_ready_packet->payload.state.transaction_id;
    m_transaction.authority = p_ready_packet->payload.state.authority;
    m_transaction.flood = p_ready_packet->payload.state.flood;
    set_timeout(STATE_TIMEOUT_READY);
    m_state = BL_STATE_DFU_READY;

    update_state_beacon();
}

static void start_target(void)
{
    set_timeout(STATE_TIMEOUT_TARGET);
    m_state = BL_STATE_DFU_TARGET;

    if (dfu_start(
            m_transaction.p_start_addr,
            m_transaction.p_bank_addr,
            m_transaction.length,
            m_transaction.segment_is_valid_after_transfer) != NRF_SUCCESS)
    {
        start_req(m_transaction.type, true);
    }
    else
    {
        transport_tx_abort(mp_beacon); /* stop beaconing */
    }
}

static void start_rampdown(void)
{
    /* the final timeout should be setup regardless of NO_TIMEOUTS flag. */
    NRF_RTC0->EVENTS_COMPARE[RTC_BL_STATE_CH] = 0;
    NRF_RTC0->CC[RTC_BL_STATE_CH] = (NRF_RTC0->COUNTER + STATE_TIMEOUT_RAMPDOWN) & RTC_MASK;
    NRF_RTC0->INTENSET = (1 << (RTC_BL_STATE_CH + RTC_INTENSET_COMPARE0_Pos));
    
    m_state = BL_STATE_VALIDATE;
    dfu_packet_t* p_beacon = beacon_set(BEACON_TYPE_FWID);
    
    if (p_beacon)
    {
        serial_tx(p_beacon, DFU_PACKET_LEN_FWID);
    }
}

static void handle_data_packet(dfu_packet_t* p_packet, uint16_t length)
{
    bool do_relay = false;
    if (p_packet->payload.data.transaction_id == m_transaction.transaction_id)
    {
        if (m_state == BL_STATE_DFU_READY)
        {
            if (p_packet->payload.start.segment == 0)
            {
                bl_info_segment_t* p_segment = NULL;
                switch (m_transaction.type)
                {
                    case DFU_TYPE_APP:
                        p_segment = m_bl_info_pointers.p_segment_app;
                        break;
                    case DFU_TYPE_SD:
                        p_segment = m_bl_info_pointers.p_segment_sd;
                        break;
                    case DFU_TYPE_BOOTLOADER:
                        p_segment = m_bl_info_pointers.p_segment_bl;
                        break;
                    default:
                        APP_ERROR_CHECK(NRF_ERROR_NOT_SUPPORTED);
                }
                
