NordicPlayground/nRF51-ble-bcast-mesh/nRF51/bootloader/bootloader_mesh.c
        case DFU_PACKET_TYPE_DATA_REQ:
            handle_data_req_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_DATA_RSP:
            handle_data_rsp_packet(p_packet, length);
            break;

        default:
            /* don't care */
            break;
    }
    NRF_GPIO->OUTCLR = (1 << 1);
    return NRF_SUCCESS;
}

void bootloader_abort(bl_end_t end_reason)
{
    uint32_t app_length = m_bl_info_pointers.p_segment_app->length;
    if (m_transaction.transaction_id != 0)
    {
        app_length = m_transaction.length;
    }
    switch (end_reason)
    {
        case BL_END_SUCCESS:
        case BL_END_ERROR_TIMEOUT:
        case BL_END_FWID_VALID:
            if (app_is_valid((uint32_t*) m_bl_info_pointers.p_segment_app->start, app_length))
            {
                interrupts_disable();
                NRF_GPIO->OUTCLR = (1 << 22);
                
                sd_mbr_command_t com = {SD_MBR_COMMAND_INIT_SD, };
        
                volatile uint32_t err_code = sd_mbr_command(&com);
                APP_ERROR_CHECK(err_code);
                
                err_code = sd_softdevice_vector_table_base_set(m_bl_info_pointers.p_segment_app->start);
                APP_ERROR_CHECK(err_code);

                NRF_GPIO->OUTSET = (1 << 21);
                NRF_GPIO->OUTSET = (1 << 22);
                bootloader_util_app_start(m_bl_info_pointers.p_segment_app->start);
            }
            break;
        default:
            NVIC_SystemReset();
            break;
    }
}

void bootloader_rtc_irq_handler(void)
{
    NRF_RTC0->INTENCLR = (1 << (RTC_BL_STATE_CH + RTC_INTENCLR_COMPARE0_Pos));
    switch (m_state)
    {
        case BL_STATE_FIND_FWID:
            bootloader_abort(BL_END_FWID_VALID);
            break;

        case BL_STATE_DFU_REQ:
        case BL_STATE_DFU_READY:
            bootloader_abort(BL_END_ERROR_NO_START);
            break;

        case BL_STATE_DFU_TARGET:
            start_req(m_transaction.type, true);
            break;

        case BL_STATE_VALIDATE:
            if (signature_check())
            {
                /* Don't want any interrupts disturbing this final stage */
                uint32_t was_masked;
                _DISABLE_IRQS(was_masked);
                
                /* write new version in bl info: */
                bl_info_entry_t new_version_entry;
                memcpy(&new_version_entry.version, m_bl_info_pointers.p_fwid, sizeof(fwid_t));
                bl_info_type_t sign_info_type = BL_INFO_TYPE_INVALID;
                
                switch (m_transaction.type)
                {
                    case DFU_TYPE_APP:
                        memcpy((void*) &new_version_entry.version.app, (void*) &m_transaction.target_fwid_union.app, DFU_FWID_LEN_APP);
                        sign_info_type = BL_INFO_TYPE_SIGNATURE_APP;
                        break;
                    case DFU_TYPE_SD:
                        memcpy((void*) &new_version_entry.version.sd, (void*) &m_transaction.target_fwid_union.sd, DFU_FWID_LEN_SD);
                        sign_info_type = BL_INFO_TYPE_SIGNATURE_SD;
                        break;
                    case DFU_TYPE_BOOTLOADER:
                        memcpy((void*) &new_version_entry.version.bootloader, (void*) &m_transaction.target_fwid_union.bootloader, DFU_FWID_LEN_BL);
                        sign_info_type = BL_INFO_TYPE_SIGNATURE_BL;
                        break;
                    default:
                        break;
                }
                m_bl_info_pointers.p_fwid = &bootloader_info_entry_put(BL_INFO_TYPE_VERSION, &new_version_entry, BL_INFO_LEN_FWID)->version;
                
                /* remove finished journal */
                bootloader_info_entry_invalidate((uint32_t*) BOOTLOADER_INFO_ADDRESS, BL_INFO_TYPE_JOURNAL);
                
                /* add signature to bl info, if applicable: */
                if (m_transaction.signature_length != 0)
                {
                    bootloader_info_entry_put(sign_info_type, (bl_info_entry_t*) m_transaction.signature, DFU_SIGNATURE_LEN);
                }
                
                _ENABLE_IRQS(was_masked);
                
                bootloader_abort(BL_END_SUCCESS);
            }
            else
            {
                /* someone gave us anauthorized firmware, and we're broken.
                   need to reboot and try to request a new transfer */
                bootloader_abort(BL_END_ERROR_UNAUTHORIZED);
            }
            break;

        default:
            break;
    }
}

void bootloader_packet_set_local_fields(mesh_packet_t* p_packet, uint8_t dfu_packet_len)
{
    mesh_packet_set_local_addr(p_packet);
    p_packet->header.type = BLE_PACKET_TYPE_ADV_NONCONN_IND;
    p_packet->header.length = DFU_PACKET_OVERHEAD + dfu_packet_len;
    ((ble_ad_t*) p_packet->payload)->adv_data_type = MESH_ADV_DATA_TYPE;
    ((ble_ad_t*) p_packet->payload)->data[0] = (MESH_UUID & 0xFF);
    ((ble_ad_t*) p_packet->payload)->data[1] = (MESH_UUID >> 8) & 0xFF;
    ((ble_ad_t*) p_packet->payload)->adv_data_length = DFU_PACKET_ADV_OVERHEAD + dfu_packet_len;
}
